"""

[Title/Звание]
    Watchdog

[Description/Обрисовка]

    Watchdog ще бъде, от една страна, регистър за животни, търсещи осиновител. За тях ще бъдат включени подробности
    като възраст, пол, порода, име, кратко описание на характера и д.р. Всяка такава обява ще се отнася за един конкетен приют
    и затова към обявата ще бъде включена и информация за приюта - местоположение, телефон, работно време. Потребителите
    ще могат да филтрират и сортират обявите по различни критерии - местоположение, вид животно и т.н. Приютите ще могат
    да добавят обяви, да ги редактират и изтриват.

    Системата ще позволява на хора, имали нещастието да изгубят домашния си любимец, да публикуват обявата в
    единен регистър с тази цел, вместо да разчитат само на социалните мрежи или на разлепени плакати.
    Освен обяви за изгубени животни, ще има и обяви за намерени животни - те ще могат да се филтрират
    по различни критерии, за да е по-лесно за собствениците евентуално да намерят домашния си любимец. Собствениците
    на изгубен домашен любимец ще могат да добавят последните места, на които е видяно животното, заедно с дата, час и друга
    информация. Същото ще могат да правят и потребители, които не са автори на обявата. Тази информация ще се наслагва върху
    карта.

    Допълнителните функционалности на системата ще включват: писане на коментари под обяви; изпращане на известия
    до автори на обяви за изгубени животни (в случай че е намерен домашен любимец, имащ общи характеристиките с техния),
    както и до потребители, взели участие в търсенето на животното.

[Functionalities/Надарености]

1. Регистрация и влизане в системата
    Потребителите могат да си създадат акаунт в системата и да се логват в него. В зависимост от ролята на влезлия
    потребител, системата предоставя различен интерфейс. Двата основни типа профили са обикновени потребители и профили на приюти.
    За да се създаде профил на приют, служител на приюта трябва да се свърже с администратор на системата, за да получи
    еднократен код за регистрация, като при регистрация се изисква въвеждане на кода.

2. Преглед на обяви за осиновяване
    Всички потребители имат право да разглеждат обявите на животни, обявени за осиновяване. Системата извлича информацията
    за обявите от базата данни, като я предоставя в удобен за потребителите формат.

3. Публикуване, изтриване и редактирене на обяви за осиновяване (само за приюти за животни)
    Профилите на приюти, които са преминали през процеса на верификация, описан в точка 1, имат правомощие да създават
    обяви за осиновяване. При нужда служителите на приюта могат да редактират и изтриват обявите. Обявите ще включват
    подробности като възраст, пол, порода, име, кратко описание на характера, отношение към деца, отношение към други животни,
    специални нужди. Към всяка такава обява ще има дата на добавяне, име на приюта, местоположение, както и статус на осиновяване.

4. Сортиране и филтриране
    Тази опция ще бъде достъпна за всички обяви, независимо от техния тип. Във всеки случай системата ще обработва
    заявките и ще връща съответните резултати от базата данни. Ще има разлики в опциите, разбира се, (например ако става дума за
    изгубени/намерени животни, е разумно да има филтър за "търси се" и филтър "намерено", както и сортиране/филтриране по време).

    Примерни критерии за сортиране и филтриране биха били следните:

    - Осиновяване на животно - филтриране по вид на животното, големина, пол, местоположение, дали има специални нужди;
    сортиране - по дата на добавяне на обявата (възходящо и низходящо)
    - Обяви за изгубени/намерени животни - филтриране по вид на животното, местоположение (ако са няколко, е достатъчно
    да съвпадне едно от тях), по диапазон от време, по тип ("търси се"/"намерено"); сортиране - по дата на добавяне на обявата (възходящо и низходящо)

    Би било смислено да се добави търсачка, не знам обаче дали времето би ми стигнало за това.

5. Публикуване, изтриване и редактиране на обяви за изгубени/намерени домашни любимци
    Потребителите, които са изгубили домашния си любимец, ще имат възможност да добавят обява, съдържаща важна информация
    като снимки, възраст, име, места, на които животното е видяно за последен път. Другите потребители ще могат да добавят локации,
    на които са видяли изгубеното животно, заедно с релевантна информация и снимки. В случай че някой вземе изгубеното животно в
    дома си, следва да напише обява, че то е било намерено, отново съдържаща уместна информация - телефонен номер, местоположение,
    коментар по състояние на животното, снимки. Авторите на обявите ще имат възможност да ги редактират и изтриват.

6. Взаимодействие на потребителя с обяви
    Потребителите могат да взаимодействат с всички видове обяви чрез коментиране.
    Програмата управлява тези взаимодействия, като актуализира обявите.

7. Интерактивна карта за изгубени/намерени домашни любимци
    Потребителите разглеждат и взаимодействат с карта за изгубени и намерени домашни любимци.
    Програмата интегрира функционалност за картографиране и наслагва изпратените от потребители данни върху картата.
    Картата може да се отнася само за конкретна обява или за всички обяви в зависимост от това откъде е отворена -
    ако е отворена от конкретна обява, то тя ще бъде обвързана само с тази обява.

8. Потребителски известия
    Потребителите получават известия за обяви, с които са взаимодействали или които самите те са създали.
    Например за авторите на обяви за изгубено животно би било полено да има известия за намерен домашен любимец,
    отговарящ на описанието на техния, нови коментари под обявата, нови добавени места, на които животното е видяно и т.н.
    Потребителите, участвали в търсенето на животно, могат да получат известие, ако то бъде намерено.
    Известяването ще се случва по имейл.

[Milestones/Възлови точки]
    Точките, по които ще работя, ще следват списъка с функционалности, който дефинирах по-горе.

    - Планиране, график и настройки на проекта
    - Настройка и управление на базата данни
    - Регистрация и влизане в системата (включва регистрация на потребители, влизане и контрол на достъпа според ролите)
    - Обяви за осиновяване (разработване на CRUD операции)
    - Сортиране и филтриране
    - Обяви за изгубени/намерени домашни любимци (разработване на CRUD операции, внедряване на функция за картографиране)
    - Взаимодействие на потребителя с обяви (добавяне на функция за коментиране)
    - Потребителски известия (добавяне на функция за известяване по имейл)
    - Front-End разработка и дизайн на потребителски интерфейс

[Estimate in man-hours/Времеоценка в човекочасове]

    - Планиране, график и настройки на проекта - 2-5 часа
    - Настройка и управление на базата данни - 20-30 часа
    - Регистрация и влизане в системата - 20-30 часа
    - Обяви за осиновяване - 30-40 часа
    - Сортиране и филтриране - 15-20 часа
    - Обяви за изгубени/намерени домашни любимци - 25-35 часа
    - Взаимодействие на потребителя с обяви - 5-10 часа
    - Потребителски известия - 5-10 часа
    - Front-End разработка и дизайн на потребителски интерфейс - 20-30 часа

    Към всяка от частите трябва да се напишат и unit тестове

    Общо време: 142-210 часа

[Usage of technologies/Потребление на технологии]

    Backend - Django
    Front-end - Bootstrap, HTML и CSS
    База данни - SQLite
    Тестване - unittest
    Карти - Folium

"""
